/*
  *created by luffy on 16.12.20
*/
//匿名函数自执行，jq是一个面向对象的程序
(function(){
    // (21-94)定义变量和函数
    // (96-283)给jq对象添加一些方法和属性
    // (285-347)extend:Jq的继承方法
    //（349-817）扩展一些工具方法,如$.trim()
    // （877-2856）sizzle:复杂选择器的实现
    // （2880-3042）Callbacks:回调对象，统一管理函数
    // （3043-3123）Deferred:延迟对象：对异步的统一管理
    // （3184-3295）support：功能检测
    // （3308-3652）data():数据缓存
    // （3653-3797）queue();队列管理
    //（3808-4299）attr() prop() val() addClass()等对元素属性的操作
    //（4300-5128）on() trigger() 等实践操作的相关方法
    //（5140-6057）DOM操作的方法 添加 删除 获取 包装DOM筛选
    // （6058-6620）css() 样式的操作
    //（6621-7854）提交的数据和ajax()
    //（7855-8584）animate() 运动的方法
    //（8585-8792）offset()scrollTop()位置尺寸的方法
    //（8804-8821）jq支持模块化的模式
    //8826  
    //window.$ = window.jQuery = jQuery;
})()